{
  "planets_data|stars|stellarref": "A SERIAL primary key uniquely identifying each host star record in the database. Maps to 'rowid' in source data.",
  "planets_data|stars|hostplname": "The name of the host star system derived from 'pl_hostname'. VARCHAR(50) NOT NULL UNIQUE constraint ensures no duplicate star names. Examples include '11 Com', 'HD 114783', 'Kepler-1649'.",
  "planets_data|stars|stellardist": "Distance to the host star measured in parsecs from 'st_dist'. REAL accommodating distances from 3.21 to 8500 parsecs. Contains  NULL when stellar distance measurements are unavailable or unreliable.",
  "planets_data|stars|compcount": "Total number of confirmed planetary companions from 'pl_pnum'. INTEGER count of planets orbiting this host star, ranging from 1 to 8+ planets per system.",
  "planets_data|planets|planetref": "A primary key INTEGER derived from 'rowid' uniquely identifying each planet record, ranging from 1 to 3372 in current dataset.",
  "planets_data|planets|hostlink": "Foreign key INTEGER referencing stars(StellarRef), linking each planet to its host star system derived from hostname matching.",
  "planets_data|planets|completter": "Planet designation from 'pl_letter' within its system. VARCHAR(10) with values: 'b', 'c', 'd', 'e', 'f', 'g', 'h' following IAU conventions where 'b' is typically the first discovered planet.",
  "planets_data|planets|notecount": "Number of literature references from 'pl_nnotes'. INTEGER tracking annotation count for this planet discovery.",
  "planets_data|planets|discmethod": "Discovery method from 'pl_discmethod'. VARCHAR(50) with standardized values: 'RadVel'/'RV'/'RV Method'/'Radial Velocity'/'Doppler' (radial velocity), 'Transit'/'TR'/'Transit Method'/'Photometry'/'Photometric' (transit photometry), 'Direct Imaging'/'DI'/'Imaging'/'IMG'/'Direct' (direct imaging), 'TTV'/'Transit Timing Variations'/'Transit Timing'/'TTV Method'/'Timing Var' (transit timing), 'Microlensing'/'ML'/'μLens'/'Lensing'/'Gravitational' (gravitational microlensing), 'Pulsar'/'PSR Timing'/'PT'/'Pulsation Timing Variations' (pulsar timing), 'Eclipse Timing Variations'/'ETV'/'Eclipse Timing'/'Timing Variations' (eclipse timing), 'Brightness Mod'/'OBM'/'Phase Curve'/'Orbital Mod' (orbital brightness modulation), 'AST' (astrometry).",
  "planets_data|orbital_characteristics|orbitalref": "A SERIAL primary key uniquely identifying each orbital characteristics record.",
  "planets_data|orbital_characteristics|bodylink": "Foreign key INTEGER referencing planets(PlanetRef), linking orbital parameters to a specific planet.",
  "planets_data|orbital_characteristics|period": "Orbital period from 'pl_orbper' measured in days. REAL accommodating periods from 0.09 days (hot Jupiters) to 7,300,000 days (20,000+ years). Contains  NULL when orbital period cannot be determined from available observations.",
  "planets_data|orbital_characteristics|semimajor": "Semi-major axis from 'pl_orbsmax' measured in AU. REAL covering range from 0.0044 AU (ultra-hot Jupiters) to 2500 AU (wide-separation planets). Contains  NULL when orbital distance cannot be reliably calculated.",
  "planets_data|orbital_characteristics|eccentricity": "Orbital eccentricity from 'pl_orbeccen' ranging from 0 (circular) to <1 (elliptical). REAL providing high precision for nearly circular orbits. Contains  NULL when eccentricity cannot be constrained from available data.",
  "planets_data|orbital_characteristics|inclination": "Orbital inclination from 'pl_orbincl' in degrees relative to sky plane. REAL ranging from 0° (face-on) to 180° (retrograde). Contains  NULL when inclination cannot be determined (e.g., for radial velocity-only discoveries).",
  "planets_data|physical_properties|physref": "A SERIAL primary key uniquely identifying each physical properties record.",
  "planets_data|physical_properties|objectlink": "Foreign key INTEGER referencing planets(PlanetRef), linking physical parameters to a specific planet.",
  "planets_data|physical_properties|massjup": "Planetary mass from 'pl_bmassj' in Jupiter mass units. REAL covering range from 0.00006 MJ (sub-Earth) to 28.5 MJ (super-Jupiter). Contains  NULL when mass cannot be determined (e.g., for transit-only discoveries without radial velocity follow-up).",
  "planets_data|physical_properties|radjup": "Planetary radius from 'pl_radj' in Jupiter radius units. REAL covering range from 0.027 RJ (sub-Earth) to 6.9 RJ (inflated giants). Contains  NULL when radius cannot be measured (e.g., for radial velocity-only discoveries).",
  "planets_data|physical_properties|densvalue": "Bulk density from 'pl_dens' in g/cm³. REAL covering gas giants (<1 g/cm³) to super-dense planets (>20 g/cm³). Contains  NULL when both mass and radius are not available for density calculation.",
  "planets_data|instruments_surveys|instrumentref": "A SERIAL primary key uniquely identifying each observational facility or survey program.",
  "planets_data|instruments_surveys|facilityname": "Observational facility name derived from flag analysis. VARCHAR(100) NOT NULL UNIQUE with values: 'ttv' (from pl_ttvflag='T'), 'kep' (from pl_kepflag=1), 'k2' (from pl_k2flag=true) representing Transit Timing Variations, Kepler mission, and K2 mission respectively.",
  "planets_data|planet_instrument_observations|obsref": "A SERIAL primary key uniquely identifying each planet-instrument observation record.",
  "planets_data|planet_instrument_observations|subjectlink": "Foreign key INTEGER referencing planets(PlanetRef), indicating which planet was observed.",
  "planets_data|planet_instrument_observations|facilitylink": "Foreign key INTEGER referencing instruments_surveys(InstrumentRef), indicating which facility made the observation.",
  "planets_data|data_quality_tracking|qualityref": "A SERIAL primary key uniquely identifying each data quality record.",
  "planets_data|data_quality_tracking|targetlink": "Foreign key INTEGER referencing planets(PlanetRef), linking quality metrics to a specific planet.",
  "planets_data|data_quality_tracking|perioderr1": "Positive uncertainty from 'pl_orbpererr1' in orbital period, in days. REAL representing +1σ error. Contains  NULL when period uncertainty is not available or period itself is unknown.",
  "planets_data|data_quality_tracking|perioderr2": "Negative uncertainty from 'pl_orbpererr2' in orbital period, in days. REAL representing -1σ error, typically stored as negative value. Contains  NULL when period uncertainty is not available.",
  "planets_data|data_quality_tracking|semimajerr1": "Positive uncertainty from 'pl_orbsmaxerr1' in semi-major axis, in AU. REAL representing +1σ error in orbital distance. Contains  NULL when semi-major axis uncertainty is not available.",
  "planets_data|data_quality_tracking|semimajerr2": "Negative uncertainty from 'pl_orbsmaxerr2' in semi-major axis, in AU. REAL representing -1σ error, accommodating asymmetric uncertainties. Contains  NULL when semi-major axis uncertainty is not available.",
  "planets_data|data_quality_tracking|eccerr1": "Positive uncertainty from 'pl_orbeccenerr1' in eccentricity. REAL representing +1σ error, typically small values <0.1. Contains  NULL when eccentricity uncertainty is not available or eccentricity is unconstrained.",
  "planets_data|data_quality_tracking|eccerr2": "Negative uncertainty from 'pl_orbeccenerr2' in eccentricity. REAL representing -1σ error, often asymmetric for low-eccentricity orbits. Contains  NULL when eccentricity uncertainty is not available.",
  "planets_data|data_quality_tracking|inclerr1": "Positive uncertainty from 'pl_orbinclerr1' in inclination, in degrees. REAL representing +1σ angular error. Contains  NULL when inclination uncertainty is not available or inclination is unconstrained.",
  "planets_data|data_quality_tracking|inclerr2": "Negative uncertainty from 'pl_orbinclerr2' in inclination, in degrees. REAL representing -1σ angular error. Contains  NULL when inclination uncertainty is not available.",
  "planets_data|data_quality_tracking|masserr1": "Positive uncertainty from 'pl_bmassjerr1' in planetary mass, in Jupiter masses. REAL representing +1σ error in mass measurement. Contains  NULL when mass uncertainty is not available or mass is unconstrained.",
  "planets_data|data_quality_tracking|masserr2": "Negative uncertainty from 'pl_bmassjerr2' in planetary mass, in Jupiter masses. REAL representing -1σ error, often asymmetric for low-mass planets. Contains  NULL when mass uncertainty is not available.",
  "planets_data|data_quality_tracking|raderr1": "Positive uncertainty from 'pl_radjerr1' in planetary radius, in Jupiter radii. REAL representing +1σ error in radius measurement. Contains  NULL when radius uncertainty is not available or radius is unconstrained.",
  "planets_data|data_quality_tracking|raderr2": "Negative uncertainty from 'pl_radjerr2' in planetary radius, in Jupiter radii. REAL representing -1σ error in radius measurement. Contains  NULL when radius uncertainty is not available.",
  "planets_data|data_quality_tracking|denserr1": "Positive uncertainty from 'pl_denserr1' in planetary density, in g/cm³. REAL representing +1σ error in density calculation. Contains  NULL when density uncertainty cannot be calculated due to missing mass or radius uncertainties.",
  "planets_data|data_quality_tracking|denserr2": "Negative uncertainty from 'pl_denserr2' in planetary density, in g/cm³. REAL representing -1σ error in density calculation. Contains  NULL when density uncertainty cannot be calculated.",
  "planets_data|data_quality_tracking|disterr1": "Positive uncertainty from 'st_disterr1' in stellar distance, in parsecs. REAL representing +1σ error in distance measurement. Contains  NULL when stellar distance uncertainty is not available.",
  "planets_data|data_quality_tracking|disterr2": "Negative uncertainty from 'st_disterr2' in stellar distance, in parsecs. REAL representing -1σ error in distance measurement. Contains  NULL when stellar distance uncertainty is not available.",
  "planets_data|data_quality_tracking|optmagerr": "Uncertainty from 'st_optmagerr' in stellar magnitude. REAL representing symmetric 1σ error in magnitude measurement. Contains  NULL when magnitude uncertainty is not available.",
  "planets_data|data_quality_tracking|temperr1": "Positive uncertainty from 'st_tefferr1' in stellar temperature, in Kelvin. REAL representing +1σ error in temperature measurement. Contains  NULL when temperature uncertainty is not available.",
  "planets_data|data_quality_tracking|temperr2": "Negative uncertainty from 'st_tefferr2' in stellar temperature, in Kelvin. REAL representing -1σ error, accommodating larger negative uncertainties. Contains  NULL when temperature uncertainty is not available.",
  "planets_data|data_quality_tracking|stellarmasserr1": "Positive uncertainty from 'st_masserr1' in stellar mass, in solar masses. REAL representing +1σ error in stellar mass. Contains  NULL when stellar mass uncertainty is not available.",
  "planets_data|data_quality_tracking|stellarmasserr2": "Negative uncertainty from 'st_masserr2' in stellar mass, in solar masses. REAL representing -1σ error in stellar mass. Contains  NULL when stellar mass uncertainty is not available.",
  "planets_data|data_quality_tracking|stellarraderr1": "Positive uncertainty from 'st_raderr1' in stellar radius, in solar radii. REAL representing +1σ error in stellar radius. Contains  NULL when stellar radius uncertainty is not available.",
  "planets_data|data_quality_tracking|stellarraderr2": "Negative uncertainty from 'st_raderr2' in stellar radius, in solar radii. REAL representing -1σ error in stellar radius. Contains  NULL when stellar radius uncertainty is not available.",
  "planets_data|data_quality_tracking|masssource": "Mass determination method from 'pl_bmassprov'. VARCHAR(50) with values: 'Msini' (minimum mass from radial velocity, M×sin(i)), 'Mass' (true mass from transit+RV or other methods), 'Msin(i)/sin(i)' (mass corrected for inclination). Contains  NULL when no mass measurement is available.",
  "planets_data|data_quality_tracking|updatestamp": "Data update timestamp from 'rowupdate'. DATE field in YYYY-MM-DD format tracking when the record was last updated, with dates ranging from 2014-05-14 to 2016-07-07 in current dataset.",
  "planets_data|stars|coordsys": {
      "column_meaning": "JSONB column. Consolidates all coordinate system information including both text and decimal representations of right ascension and declination, providing complete positional data for the host star.",
      "fields_meaning": {
        "RA_Text": "Right ascension coordinate in sexagesimal format derived from 'ra_str'. VARCHAR(60) with format like '12h20m43.03s', '15h17m05.89s', accommodating hours-minutes-seconds notation. Contains  NULL when coordinate string representation is not available.",
        "RA_Decimal": "Right ascension coordinate converted to decimal degrees from 'ra' field. REAL providing precision to arc-second level, ranging from 0 to 360 degrees. Contains  NULL when precise coordinates are not available.",
        "Dec_Text": "Declination coordinate in sexagesimal format derived from 'dec_str'. VARCHAR(60) with format like '+17d47m34.3s', '+71d49m26.0s', '-39d14m10.3s', accommodating degrees-arcminutes-arcseconds notation with sign prefix. Contains  NULL when coordinate string representation is not available.",
        "Dec_Decimal": "Declination coordinate converted to decimal degrees from 'dec' field. REAL providing precision to arc-second level, ranging from -90 to +90 degrees. Contains  NULL when precise coordinates are not available."
      }
    },
  "planets_data|stars|stellarprops": {
    "column_meaning": "JSONB column. Groups all stellar physical properties and their measurement quality flags, including photometric, temperature, mass, and radius measurements with blend indicators.",
    "fields_meaning": {
      "photometry": {
        "Opt_Mag": "Optical magnitude of the host star from 'st_optmag'. REAL covering magnitude range typically from -1.5 to 20+ magnitudes. Contains  NULL when stellar magnitude measurements are not available.",
        "Mag_Blend": "Blend flag from 'st_optmagblend' indicating if optical magnitude is affected by stellar companions. REAL with values 0 (no blending), 1 (blended measurement). Contains  NULL when blending status is unknown.",
        "Photo_Band": "Photometric band from 'st_optband' used for magnitude measurement. TEXT field with NOISE containing inconsistent representations of the same bands: 'V (Johnson)', 'Johnson', 'V', 'Johnson V' (all representing Johnson V-band), 'Kepler-band', 'Kepler', 'Kep-b', 'Kep' (all representing Kepler band), 'V-band', 'K-band'. Contains  NULL when photometric band information is not available."
      },
      "physical": {
        "Temp_Value": "Effective temperature from 'st_teff' measured in Kelvin. REAL covering range from 575K to 57000K. Contains  NULL when stellar temperature measurements are not available or unreliable.",
        "Temp_Blend": "Temperature blend flag from 'st_teffblend' indicating measurement quality. REAL with values 0 (clean measurement), 1 (affected by blending). Contains  NULL when temperature blending status is unknown.",
        "Mass_Value": "Stellar mass from 'st_mass' in solar mass units (M☉). REAL covering range from low-mass stars to massive stars. Contains  NULL when stellar mass cannot be determined from available data.",
        "Mass_Blend": "Mass blend flag from 'st_massblend' indicating measurement reliability. REAL with values 0 (direct measurement), 1 (affected by multiplicity). Contains  NULL when mass blending status is unknown.",
        "Radius_Value": "Stellar radius from 'st_rad' in solar radius units (R☉). REAL covering range from sub-solar to giant stars. Contains  NULL when stellar radius measurements are not available.",
        "Rad_Blend": "Radius blend flag from 'st_radblend' indicating measurement quality. REAL with values 0 (clean measurement), 1 (affected by stellar activity). Contains  NULL when radius blending status is unknown."
      }
    }
  },
  "planets_data|data_quality_tracking|limitflags": {
    "column_meaning": "JSONB column. Consolidates all measurement limit flags indicating whether values represent actual measurements, upper limits, or lower limits for planetary and stellar parameters.",
    "fields_meaning": {
      "planetary_limits": {
        "Period_Lim": "Limit flag from 'pl_orbperlim' for orbital period. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "Semimaj_Lim": "Limit flag from 'pl_orbsmaxlim' for semi-major axis. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "Ecc_Lim": "Limit flag from 'pl_orbeccenlim' for eccentricity. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "Incl_Lim": "Limit flag from 'pl_orbincllim' for inclination. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "Mass_Lim": "Limit flag from 'pl_bmassjlim' for planetary mass. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "Rad_Lim": "Limit flag from 'pl_radjlim' for planetary radius. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "Dens_Lim": "Limit flag from 'pl_denslim' for planetary density. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable."
      },
      "stellar_limits": {
        "Dist_Lim": "Limit flag from 'st_distlim' for stellar distance. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "OptMag_Lim": "Limit flag from 'st_optmaglim' for stellar magnitude. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "Temp_Lim": "Limit flag from 'st_tefflim' for stellar temperature. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "StellarMass_Lim": "Limit flag from 'st_masslim' for stellar mass. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable.",
        "StellarRad_Lim": "Limit flag from 'st_radlim' for stellar radius. REAL with values: 0 (measured value), 1 (upper limit), -1 (lower limit). Contains  NULL when limit status is unknown or not applicable."
      }
    }
  }
}