{
  "hulushows|companies|entity_key": "A BIGINT primary key uniquely identifying each production company, studio, or content distributor in the database.",
  "hulushows|companies|chanref": "Legacy channel reference ID used for backwards compatibility with older systems, may contain gaps and non-sequential values. Contains  NULL when legacy channel reference is not available or not applicable for newer companies.",
  "hulushows|companies|company_name": "Official full legal name of the production company or content distributor (e.g., 'Walt Disney Pictures', 'Warner Bros Entertainment'). Contains  NULL when official company name is not available or company operates under alternative naming conventions.",
  "hulushows|companies|short_name": "Abbreviated or commonly used short name for the company (e.g., 'Disney', 'Warner Bros'). Contains  NULL when no commonly recognized short name exists for the company.",
  "hulushows|companies|canonical_name": "Standardized canonical name used for consistent reference across the platform, normalized for search and matching purposes. Contains  NULL when canonical normalization has not been established for the company.",
  "hulushows|core|content_key": "A BIGINT primary key uniquely identifying each show or content item in the Hulu database system.",
  "hulushows|core|canonical_name": "Standardized canonical name of the show used for consistent reference and search functionality across the platform. Contains  NULL when canonical naming has not been established for the content.",
  "hulushows|core|content_title": "Display title of the show as it appears to users on the platform interface. Contains  NULL when display title is not yet finalized or content is in preliminary stages.",
  "hulushows|core|series_id": "Identifier linking individual shows to their parent series or franchise for grouping related content. Contains  NULL when content is standalone and not part of a larger series or franchise.",
  "hulushows|core|studiolink": "Foreign key referencing companies.Entity_key, indicating the primary production studio. Contains  NULL for independent or self-produced content without studio affiliation.",
  "hulushows|core|annotations": "Combined free-text annotations and metadata comments from multiple sources, concatenated from annotation fields 0 and 1. Contains  NULL when no annotations or metadata comments are available for the content.",
  "hulushows|availabilitys|content_key": "Primary key referencing core.content_key, ensuring 1:1 relationship for availability information per show.",
  "hulushows|availabilitys|cache_time": "Timestamp indicating when the content metadata was last cached or updated. Contains noise with inconsistent date formats: '2024-12-08', '2024/12/8', '24/12/8', 'Dec 8, 2024'. Contains  NULL when cache timestamp is not available or content has never been cached.",
  "hulushows|availabilitys|auth_name": "Authentication or authorization level name required to access the content, indicating access control requirements. Contains  NULL when no specific authentication requirements are needed for content access.",
  "hulushows|content_info|content_key": "Primary key referencing core.content_key, ensuring 1:1 relationship for detailed content information per show.",
  "hulushows|content_info|story_outline": "Detailed plot synopsis or description of the show's storyline and content for user discovery and recommendation systems. Contains  NULL when plot synopsis is not available or content description is pending.",
  "hulushows|promo_info|content_key": "Primary key referencing core.content_key, ensuring 1:1 relationship for promotional messaging per show.",
  "hulushows|rollups|tierkey": "A BIGSERIAL primary key uniquely identifying each subscription and availability tier in the system.",
  "hulushows|rollups|tiertype": "Enumerated subscription tier type from: 'free' (free content), 'subscriber' (paid subscriber content), 'current' (currently available content), 'free_on_web' (web-only free content), 'subscriber_on_device' (device-specific subscriber content), 'auth_on_web' (web authentication required), 'showtime' (Showtime premium content).",
  "hulushows|show_rollups|srkeys": "Foreign key referencing core.content_key, indicating which show this rollup metrics record belongs to.",
  "hulushows|show_rollups|srlinks": "Foreign key referencing rollups.TierKey, indicating which subscription tier these metrics apply to.",
  "hulushows|show_rollups|launchmoment": "Timestamp indicating when content was first made available in this subscription tier. Contains noise with inconsistent formats: '2024-12-08 10:30', 'Dec 8, 2024', '08/12/24'. Contains  NULL when launch date is not available or content has not yet launched in this tier.",
  "hulushows|show_rollups|latestadd": "Timestamp of the most recent content addition or update for this show in the specified tier. Contains  NULL for shows with no recent updates or when no content additions have been tracked.",
  "hulushows|companies|brandingassets": {
    "column_meaning": "JSONB column. Consolidates all branding and visual assets for the company including key art, logos, and availability flags for display purposes.",
    "fields_meaning": {
      "KeyArt_URL": "URL pointing to the company's key art image or logo used for branding display purposes on the platform. Contains  NULL when key art is not available or company does not provide branding assets.",
      "NetworkLogo_URL": "URL pointing to the network or company logo image file for display in the user interface. Contains  NULL when network logo is not available or company operates without branded logo assets.",
      "HasLogo_Flag": "Boolean flag stored as text indicating whether the company has a high-resolution logo available. Contains noise with inconsistent formats: 'TRUE', 'FALSE', 'Yes', 'No', '1', '0'. Contains  NULL when logo availability status is unknown or not determined."
    }
  },
  "hulushows|core|genreclass": {
    "column_meaning": "JSONB column. Groups all genre and classification metadata including primary genre, complex genre hierarchies, content class, and user scoring information.",
    "fields_meaning": {
      "Primary_Genre": "Primary broad genre category from enum: 'Animation and Cartoons', 'Comedy', 'Drama', 'Anime', 'Kids', 'Reality and Game Shows', 'Classics', 'Family', 'Science Fiction', 'Action and Adventure', 'Food', 'News and Information', 'Health and Wellness', 'Teen'. Contains  NULL when primary genre classification is pending or undetermined.",
      "Hierarchical_Genres": "Complex multi-genre classification string with hierarchical and combined genres using delimiters like '~' and '|' (e.g., 'Animation~Comedy|Teen'). Contains  NULL when detailed genre hierarchy has not been established for the content.",
      "Content_Type": "Classification of content type, primarily observed as 'show' in the dataset but may include other values like 'movie' or 'special'. Contains  NULL when content type classification is pending review or determination.",
      "User_Score": "User rating or professional score for the content, stored as text with various formats including monetary ('$4.35M'), star ratings ('4.35★'), basis points ('435 bp'), and rating scales ('4.35 RTG'). Contains  NULL when no user ratings or professional scores are available for the content."
    }
  },
  "hulushows|content_info|mediacounts": {
    "column_meaning": "JSONB column. Aggregates all content volume metrics including episodes, clips, films, seasons, and total video counts for inventory tracking.",
    "fields_meaning": {
      "content_volumes": {
        "Clips_Total": "Total number of short video clips or previews available for this content item. Contains  NULL when clip count is not available or no clips exist for the content.",
        "Episode_Total": "Episode volume count, representing the total number of episodes available for the show across all seasons. Contains  NULL when episode count is not available or content is not episodic.",
        "Feature_Films": "Number of full-length feature films associated with this content entry. Contains  NULL when feature film count is not applicable or not available for the content type.",
        "Film_Clips": "Number of short clips or trailers specifically related to films within this content package. Contains  NULL when film clips are not available or not applicable to the content.",
        "Seasons_Total": "Total number of seasons available for this show on the platform. Contains  NULL when season count is not applicable (e.g., for movies) or not yet determined.",
        "Videos_Total": "Aggregate count of all video content types (episodes, clips, features) associated with this show. Contains  NULL when total video count is not available or cannot be determined."
      }
    }
  },
  "hulushows|content_info|visualassets": {
    "column_meaning": "JSONB column. Contains all visual and descriptive assets for content presentation including URLs, descriptions, and copyright information.",
    "fields_meaning": {
      "Thumbnail_URL": "URL pointing to the small thumbnail image used for content discovery and grid displays. Contains  NULL when thumbnail image is not available or not yet uploaded for the content.",
      "KeyArt_URL": "URL pointing to the primary promotional artwork or poster image for the content. Contains  NULL when key art is not available or promotional materials are pending.",
      "Link_Desc": "Descriptive text used for content linking and cross-references within the platform. Contains  NULL when link description is not available or not yet created.",
      "Art_Copyright": "Copyright information and attribution for the promotional artwork and images associated with the content. Contains  NULL when copyright information is not available or not applicable."
    }
  },
  "hulushows|availabilitys|accessflags": {
    "column_meaning": "JSONB column. Consolidates all boolean flags related to content access restrictions and platform availability across different tiers and devices.",
    "fields_meaning": {
      "Movie_Flag": "Boolean flag stored as text indicating if content is a movie format. Contains noise with various formats: 'TRUE', 'FALSE', 'Y', 'N', 'Movie', 'Series'. Contains  NULL when content format classification is not yet determined.",
      "Showtime_Only": "Boolean indicating whether content is exclusively available through Showtime subscription tier. Contains  NULL when Showtime exclusivity status is not yet determined or not applicable.",
      "Subscriber_Only": "Boolean indicating whether content requires a paid subscription to access, not available in free tier. Contains  NULL when subscription requirement status is pending determination.",
      "COPPA_Comp": "Boolean indicating whether content complies with Children's Online Privacy Protection Act (COPPA) regulations for child-safe viewing. Contains  NULL when COPPA compliance status is not yet evaluated or not applicable.",
      "Web_Only": "Boolean indicating whether content is exclusively available through web platform and not on mobile or living room devices. Contains  NULL when platform availability restrictions are not yet determined."
    }
  },
  "hulushows|promo_info|tiernotices": {
    "column_meaning": "JSONB column. Organizes promotional and notification messages by subscription tier including availability, expiration, alerts, and promotional content.",
    "fields_meaning": {
      "free_tier": {
        "Avail_Note": "Free tier availability notification text displayed to users about content access in the free subscription level. Contains  NULL when no specific availability notifications are needed for free tier access.",
        "Expire_Note": "Free tier expiration notice text informing users when free access to content will end. Contains  NULL when content has no expiration date in free tier or expiration notice is not applicable.",
        "Alert_Note": "Free tier alert message text for important notifications related to free content access changes. Contains  NULL when no alerts are currently active for free tier content.",
        "Promo_Note": "Free tier promotional message text used for marketing and user engagement for free content. Contains  NULL when no promotional messaging is active for free tier."
      },
      "member_tier": {
        "Avail_Note": "Member/subscriber tier availability notification text displayed to paying subscribers about content access. Contains  NULL when no specific availability notifications are needed for subscriber access.",
        "Expire_Note": "Member/subscriber tier expiration notice text informing paid users when content access will end. Contains  NULL when content has no expiration date for subscribers or expiration notice is not applicable.",
        "Alert_Note": "Member/subscriber tier alert message text for important notifications related to subscriber content access. Contains  NULL when no alerts are currently active for subscriber content.",
        "Promo_Note": "Member/subscriber tier promotional message text used for marketing premium content to paying subscribers. Contains  NULL when no promotional messaging is active for subscriber tier."
      }
    }
  },
  "hulushows|show_rollups|contentvols": {
    "column_meaning": "JSONB column. Groups all content volume metrics for different media types within subscription tiers including clips, episodes, features, games, and seasons.",
    "fields_meaning": {
      "standard_content": {
        "Clip_Vol": "Volume count of short video clips available for this show in the specified subscription tier. May contain professional notation like '288K'. Contains  NULL when clip volume data is not available for this tier.",
        "Ep_Vol": "Episode volume count available for this show in the specified subscription tier. Contains  NULL when episode data is not available or not applicable for this tier.",
        "Feature_Vol": "Count of full-length feature content items available in this tier for the show. Contains  NULL when feature content is not available or not applicable for this subscription tier.",
        "FilmClip_Vol": "Volume count of film-related clips and trailers available in this subscription tier. Contains  NULL when film clips are not available for this tier.",
        "Trailer_Vol": "Count of trailer videos available for this show in the specified subscription tier. Contains  NULL when trailers are not available for this tier.",
        "Game_Vol": "Count of interactive games or game-related content available in this tier. Contains  NULL when game content is not available or not applicable for this subscription tier.",
        "Season_Vol": "Number of complete seasons available for this show in the specified subscription tier. Contains  NULL when season data is not available for this tier.",
        "Media_Total": "Total aggregate count of all media types (episodes, clips, features, games) available in this tier. Contains  NULL when total media count cannot be determined for this tier."
      }
    }
  },
  "hulushows|show_rollups|html5metrics": {
    "column_meaning": "JSONB column. Consolidates HTML5-compatible content counts for cross-platform streaming capabilities across different media types.",
    "fields_meaning": {
      "html5_volumes": {
        "H5_Clips": "Count of HTML5-compatible video clips available for cross-platform playback in this subscription tier. Contains  NULL when HTML5 clip data is not available for this tier.",
        "H5_Episodes": "Count of HTML5-compatible full episodes available for cross-platform streaming in this tier. Contains  NULL when HTML5 episode data is not available for this tier.",
        "H5_Games": "Count of HTML5-compatible interactive games or game content available in this subscription tier. Contains  NULL when HTML5 game content is not available for this tier.",
        "H5_Features": "Count of HTML5-compatible feature-length content available for streaming in this tier. Contains  NULL when HTML5 feature content is not available for this tier.",
        "H5_FilmClips": "Count of HTML5-compatible film clips and movie trailers available in this subscription tier. Contains  NULL when HTML5 film clips are not available for this tier.",
        "H5_Trailers": "Count of HTML5-compatible trailer videos available for cross-platform viewing in this tier. Contains  NULL when HTML5 trailers are not available for this tier.",
        "H5_MediaTotal": "Total aggregate count of all HTML5-compatible media content available in this subscription tier. Contains  NULL when HTML5 total count cannot be determined for this tier."
      }
    }
  },
  "hulushows|show_rollups|ratinginfo": {
    "column_meaning": "JSONB column. Contains television rating information and unrated content counts for content classification and parental guidance.",
    "fields_meaning": {
      "TV_Rating": "Television content rating or classification for content in this tier, stored as text with possible enum values like 'TV-14', 'TV-MA', 'TV-PG', etc. Contains  NULL when content rating has not been assigned or is pending review for this tier.",
      "Peak_Rating": "Highest or peak content rating for content in this tier, stored as text with possible noise in enum format: 'TV-14', 'TV14', 'T14', 'FOURTEEN'. Contains  NULL when peak rating cannot be determined or no rated content exists in this tier.",
      "Unrated_Vol": "Count of content items that do not have official television ratings or are unrated in this tier. Contains  NULL when unrated content count is not available or not tracked for this tier."
    }
  }
}